app/controllers/estimates_controller.rb

SELECT "events".* FROM "events"
---
    def listEvents
        events = Event.all

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def estimateEvent
        event = Event.find(params[:id])

SELECT "events".* FROM "events"
---
    def estimateScreen
        events = Event.all

INSERT INTO "events" ("tipo", "name", "created_at", "updated_at", "descricao", "participantes", "hora_inicio", "hora_fim", "estado", "cidade", "endereco", "link") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def newEvent
        event = Event.new
        event.tipo = params[:tipo]
        event.name = params[:name]
        event.categoria = params[:categoria]
        event.descricao = params[:descricao]
        event.participantes = params[:participantes]
        event.hora_fim  = params[:hora_fim]
        event.hora_inicio  = params[:hora_inicio]
        event.estado  = params[:estado]
        event.cidade  = params[:cidade]
        event.endereco  = params[:endereco]
        event.link = params[:link]
        event.save